set session sql_mode='ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION';
-- ----------------------------

-- 项目表 新增是否上海项目标志  wangyongliang
-- ----------------------------
ALTER TABLE `zt_project` ADD COLUMN `isShangHai` varchar(10) DEFAULT '2' COMMENT '是否上海项目 1:是 2：否';

-- ----------------------------
-- 项目表 更新上海项目标志  wangyongliang
-- ----------------------------

update zt_project set isShangHai = '1' where id in (18665,18666,18998,19862,19875,19960,21502,21530,21554,21579,21603,21627,21651,21675,21699,21723,
21747,21771,21795,21819,21843,21867,21891,21915,21939,21964,21987,22012,22036,22060,22084,
22108,22132,22156,22180,22198,22210,22222,22234,22246,22258,22270,22282,22294,22306,22318,22330,
22342,22354,22366,22378,22390,22402,22414,22426,22438,22450,22462,22474,22486,22498,22510,22522,
22534,22546,22558,22570,22582,22594,22606,22618,22630,22642,22654,22666) limit 75;

-- ----------------------------
-- action表加索引  wangyongliang
-- ----------------------------
ALTER TABLE `zt_action` ADD INDEX `execution` (`execution`) USING BTREE ;